In [2]:
import os
import pandas as pd
movies = pd.read_csv(os.path.join('data', 'movies.xls'))
ratings = pd.read_csv(os.path.join('data', 'ratings.xls'))

In [4]:
movies.head()

,movieId,title,genres
0,1,Toy Story (1995),Adventure|Animation|Children|Comedy|Fantasy
1,2,Jumanji (1995),Adventure|Children|Fantasy
2,3,Grumpier Old Men (1995),Comedy|Romance
3,4,Waiting to Exhale (1995),Comedy|Drama|Romance
4,5,Father of the Bride Part II (1995),Comedy

In [5]:
ratings.head()

   userId  movieId  rating  timestamp
0       1        1     4.0  964982703
1       1        3     4.0  964981247
2       1        6     4.0  964982224
3       1       47     5.0  964983815
4       1       50     5.0  964982931

In [6]:
ratings.count()

userId       100836
movieId      100836
rating       100836
timestamp    100836
dtype: int64

In [7]:
ratings.rating.min()

0.5

In [8]:
ratings.rating.max()

5.0

In [9]:
movies.count()\

movieId    9742
title      9742
genres     9742
dtype: int64

In [10]:
joined = ratings.merge(movies, on='movieId', how='left')

In [11]:
joined.head()

,userId,movieId,rating,timestamp,title,genres
0,1,1,4.0,964982703,Toy Story (1995),Adventure|Animation|Children|Comedy|Fantasy
1,1,3,4.0,964981247,Grumpier Old Men (1995),Comedy|Romance
2,1,6,4.0,964982224,Heat (1995),Action|Crime|Thriller
3,1,47,5.0,964983815,Seven (a.k.a. Se7en) (1995),Mystery|Thriller
4,1,50,5.0,964982931,"Usual Suspects, The (1995)",Crime|Mystery|Thriller

In [12]:
len(ratings) == len(joined)

True

In [14]:
r_example = pd.read_csv(os.path.join('data', 'ratings_example.txt'), sep='\t')
r_example.head()

   userId  movieId  rating   timestamp
0       1       31     2.5  1260759144

In [15]:
m_example = pd.read_csv(os.path.join('data', 'movies_example.txt'), sep='\t')
m_example.head()

   movieId                                      title                   genres
0       31                    Dangerous Minds (1995)                     Drama
1       32  Twelve Monkeys (a.k.a. 12 Monkeys) (1995)  Mystery|Sci-Fi|Thriller
2       31                    Dangerous Minds (1995)                     Drama

In [16]:
t1 = r_example.merge(m_example, how='left', on='movieId')
t1.head()

   userId  movieId  rating   timestamp                    title genres
0       1       31     2.5  1260759144  Dangerous Minds (1995)   Drama
1       1       31     2.5  1260759144  Dangerous Minds (1995)   Drama

In [17]:
t2 = r_example.merge(m_example, how='right', on='movieId')
t2.head()

,userId,movieId,rating,timestamp,title,genres
0,1.0,31,2.5,1.260759e+09,Dangerous Minds (1995),Drama
1,1.0,31,2.5,1.260759e+09,Dangerous Minds (1995),Drama
2,NaN,32,NaN,NaN,Twelve Monkeys (a.k.a. 12 Monkeys) (1995),Mystery|Sci-Fi|Thriller

In [18]:
t3 = r_example.merge(m_example, how='inner', on='movieId')
t3.head()

   userId  movieId  rating   timestamp                    title genres
0       1       31     2.5  1260759144  Dangerous Minds (1995)   Drama
1       1       31     2.5  1260759144  Dangerous Minds (1995)   Drama

In [19]:
t4 = r_example.merge(m_example, how='outer', on='movieId')
t4.head()

,userId,movieId,rating,timestamp,title,genres
0,1.0,31,2.5,1.260759e+09,Dangerous Minds (1995),Drama
1,1.0,31,2.5,1.260759e+09,Dangerous Minds (1995),Drama
2,NaN,32,NaN,NaN,Twelve Monkeys (a.k.a. 12 Monkeys) (1995),Mystery|Sci-Fi|Thriller

In [20]:
items_dict = {

    'item_id': [417283, 849734, 132223, 573943, 19475, 3294095, 382043, 302948, 100132, 312394], 

    'vendor': ['Samsung', 'LG', 'Apple', 'Apple', 'LG', 'Apple', 'Samsung', 'Samsung', 'LG', 'ZTE'],

    'stock_count': [54, 33, 122, 18, 102, 43, 77, 143, 60, 19]

}

In [21]:
purchase_log = {

    'purchase_id': [101, 101, 101, 112, 121, 145, 145, 145, 145, 221],

    'item_id': [417283, 849734, 132223, 573943, 19475, 3294095, 382043, 302948, 103845, 100132], 

    'price': [13900, 5330, 38200, 49990, 9890, 33000, 67500, 34500, 89900, 11400]

}

In [27]:
items_df = pd.DataFrame(items_dict)
purchase_df = pd.DataFrame(purchase_log)

In [29]:
joined_1 = purchase_df.merge(items_df, on='item_id', how='outer')
display(joined_1)

    purchase_id  item_id    price   vendor  stock_count
0         101.0   417283  13900.0  Samsung         54.0
1         101.0   849734   5330.0       LG         33.0
2         101.0   132223  38200.0    Apple        122.0
3         112.0   573943  49990.0    Apple         18.0
4         121.0    19475   9890.0       LG        102.0
5         145.0  3294095  33000.0    Apple         43.0
6         145.0   382043  67500.0  Samsung         77.0
7         145.0   302948  34500.0  Samsung        143.0
8         145.0   103845  89900.0      NaN          NaN
9         221.0   100132  11400.0       LG         60.0
10          NaN   312394      NaN      ZTE         19.0

In [33]:
joined_1.dropna()['item_id'].nunique()

9

In [36]:
joined_2 = items_df.merge(purchase_df, how='left', on='item_id')
joined_2.head()

   item_id   vendor  stock_count  purchase_id    price
0   417283  Samsung           54        101.0  13900.0
1   849734       LG           33        101.0   5330.0
2   132223    Apple          122        101.0  38200.0
3   573943    Apple           18        112.0  49990.0
4    19475       LG          102        121.0   9890.0

In [37]:
joined_2['stock_volume'] = joined_2['price'] * joined_2['stock_count']

In [39]:
joined_2.head()

   item_id   vendor  stock_count  purchase_id    price  stock_volume
0   417283  Samsung           54        101.0  13900.0      750600.0
1   849734       LG           33        101.0   5330.0      175890.0
2   132223    Apple          122        101.0  38200.0     4660400.0
3   573943    Apple           18        112.0  49990.0      899820.0
4    19475       LG          102        121.0   9890.0     1008780.0

In [42]:
joined_2[(joined_2.stock_volume == joined_2.stock_volume.max())]

   item_id   vendor  stock_count  purchase_id    price  stock_volume
6   382043  Samsung           77        145.0  67500.0     5197500.0

In [43]:
joined_2.stock_volume.sum()

19729490.0

In [44]:
files = os.listdir(os.path.join('data', 'data'))

In [45]:
files

['ratings_1.txt',
 'ratings_10.txt',
 'ratings_2.txt',
 'ratings_3.txt',
 'ratings_4.txt',
 'ratings_5.txt',
 'ratings_6.txt',
 'ratings_7.txt',
 'ratings_8.txt',
 'ratings_9.txt']

In [46]:
files = ['setup.py', 'ratings.txt', 'stock_stats.txt', 'movies.txt', 'run.sh', 'game_of_thrones.mov']

In [47]:
data = [x for x in files if 'txt' in x]

In [48]:
data

['ratings.txt', 'stock_stats.txt', 'movies.txt']

In [50]:
data = pd.DataFrame(columns = ['userId', 'movieId', 'rating', 'timestamp'])

In [51]:
for f in os.listdir(os.path.join('data', 'data')):
    tmp = pd.read_csv(os.path.join('data', 'data', f), names = ['userId', 'movieId', 'rating', 'timestamp'])
    data = pd.concat([data, tmp])

In [52]:
len(data)

100004

In [53]:
ratings[(ratings.rating == ratings.rating.min())].count()

userId       1370
movieId      1370
rating       1370
timestamp    1370
dtype: int64

In [54]:
len(ratings.merge(movies, on='movieId', how='outer'))

100854

In [55]:
df_5 = ratings.merge(movies, how='left', on='movieId')

In [56]:
df_5[(df_5.movieId == 3456)]

Empty DataFrame
Columns: [userId, movieId, rating, timestamp, title, genres]
Index: []

In [57]:
movies[(movies.movieId == 3456)]

      movieId                                         title genres
2587     3456  Color of Paradise, The (Rang-e khoda) (1999)  Drama

In [58]:
ratings[(ratings.movieId == 3456)]

Empty DataFrame
Columns: [userId, movieId, rating, timestamp]
Index: []